# # 0)

# # მოცემულია სია 10 ელემენტით
# items = ["ელემენტი1", "ელემენტი2", "ელემენტი3", "ელემენტი4", "ელემენტი5", 
#          "ელემენტი6", "ელემენტი7", "ელემენტი8", "ელემენტი9", "ელემენტი10"]

# # დავპრინტოთ ეს ელემენტები
# for item in items:
#     print(item)


# # 1)

# # შევქმნათ ცარიელი სია
# user_list = []

# # მომხმარებელს შევეკითხოთ 1000 ჯერ თუ რისი დამატება სურს სიაში
# for _ in range(1000):
#     item = input("რა გსურთ დაამატოთ სიაში? ")
#     user_list.append(item)


# # 2)

# # შევქმანათ ცარიელი სია
# user_list = []

# # მომხმარებელს შევეკითხოთ რა სიტყვას უნდა დაამატოს სიაში და გავითვალისწინოთ რომ არ აღემატებოდეს 6 ასოს
# for _ in range(1000):
#     word = input("შეიყვანეთ სიტყვა (6 ასოზე ნაკლები): ")
#     if len(word) <= 6:
#         user_list.append(word)
#     else:
#         print("სიტყვა აღემატება 6 ასოს, სცადეთ ხელახლა")


# # 3)

# # შევქმნათ ცარიელი სია
# main_list = []

# # სიაში დავამატოთ კიდევ 2 სია
# sub_list1 = []
# sub_list2 = []
# main_list.append(sub_list1)
# main_list.append(sub_list2)

# # გადავატაროთ for loop ში
# for sublist in main_list:
#     print(sublist)



# # 4)

# # # შექმნილი არის სია სადაც წერია ჩვენი სახელი და გვარი, str სახით
# name_list = ["სახელი1 გვარი1", "სახელი2 გვარი2"]

# # წამოვიღოთ ეს სტრინგები და შევართოთ ერთ ცვლადში
# full_names = " ".join(name_list)
# print(full_names)



