print 5-3   #print(5-3)
 #ამ შემთხვევაში ჩვენ ვიყენებთ ბრძანება print-ს და ჩვენ ვიცით რომ ბრძანება print ფრჩხილების 
 #გარეშე არაფერია და ეს ბრძანება რომ იმუშაოს ჩვენ აუცილებლად print-ის გვერდით უნდა დავწეროთ
 #ფრჩიხილები.

print(good)   #print("good") 
 #აქ ჩვენ ისევ გვაქ ბრძანება print ასევე ჩვენ ვიცით რომ როცა ჩვენ მოქვცეული გვაქ ფრჩხილებში string
 #სიტყვა ჩვენ ეს სიტყვა აუცილებლად უნდა მოვათავსოთ ბრჭყალებში რადგან თუ ჩვენ string-ს არ
#მოვათავსებთ ბრჭყალებში ის არ იმუშავებს და გამოიტანს errors.

print"salam"  #print("salam")
  #ამ შემთხვევაში ჩვენ ვიყენებთ ბრძანება print-ს და ჩვენ ვიცით რომ ბრძანება print ფრჩხილების 
  #გარეშე არაფერია და ეს ბრძანება რომ იმუშაოს ჩვენ აუცილებლად print-ის გვერდით უნდა დავწეროთ
  #ფრჩიხილები.

item^-^bike   #item ="bike"
#აქ ჩვენ შევქმენით ცვლადი სახელად "item" მერე მას მივანიჭეთ მნიშვნელობა "bike"
#თუ ჩვენ გვინდა ნებისმიერ ცვლადს მივანიჭოთ მნიშვნელობა ჩვენ უნდა აუცილებლად დავწეროთ ცვლადის მერე ტოლობა
#რადგან  შემდგომ გაშვების შედეგად მან გამოიტანოს ის მნიშვნელობა რაც მივანიჭეთ.

device = ipad  #device ="ipad"
#აქაც ჩვენ შევქმენით ცვლადი რომელსაც მივანიჭეთ მნიშვნელობა მაგრამ ამ შემთხვევაში ჩვენ string-ს
#არ მივუწერეთ  ბრჭყალები რის გამოც ის არ იმუშავებს. 

=country "france"  #country= "france"
#აქაც ჩვენ შევქმენით ცვლადი რომელსაც მივანიჭეთ მნიშვნელობა მაგრამ ამ შემთხვევაში
#ჩვენ არასწორ ადგილას დავწერეთ ტოლობა რის გამოც ეს კოდი არ იმუშავებს და არ გამოიტანს იმას რაც ჩვენ გვინდა.

100= score   #score=100
#აქაც ჩვენ შევქმენით ცვლადი რომელსაც მივანიჭეთ მნიშვნელობა მაგრამ ამ შემთხვევაში
#ჩვენ ჯერ უნდა დაგვეწერა ცვლადი ანუ "score" ხოლო ტოლობის მერე მნიშვნელობა ანუ 100.

paris="city"  #city= "paris"
#აქაც ჩვენ შევქმენით ცვლადი რომელსაც მივანიჭეთ მნიშვნელობა მაგრამ ამ შემთხვევაში
#ჩვენ ჯერ უნდა დაგვეწერა ცვლადი ანუ city ხოლო ტოლობის მერე მნიშვნელობა ანუ "paris". 

print("100")  #print(100)
#აქ ჩვენ უკვე ვიცით რომ ბრძანება print-ის მერე იწერება ფრჩხილები მაგარამ
#აქ ჩვენ ბრჭყალებში გვაქ მოთვსებული int და ჩვენ ვიცით რომ როცა ჩვენ გვაქ int ჩვენ ის არ შეიძლება 
#მოვათავსოთ ბრჭყალებში.

prnt("home work")  #print("home work")
#აქ ჩვენ გვაქ გამოტოვებული ასო ამიტომაც კოდი უბრალოდ არ იმუშავებს და გამოიტანს errors.

exitonclick  #exitonclick()
#exitonclick() არის ბრძანება რომელსაც ჩვენ ვიყენებთ როცა გვიწერია from turtle import * ეს ბრძანება გვეხმარება ჩვენ იმასში რომ
#ის რაც ჩვენ დავხაზეთ არ გაქრეს და ცოტახანი დავაკვირდეთ რომ ვნახოთ თუ რა და როგორ უნდა გავაგრძელოთ

from turtle import  #from turtle import *
#აქ ჩვენ გვაქ არც ისე ძნელი შეცდომა რისი გამოსწორება დიდ
#დროს არ ინდომებს მაგრამ ისეთი შეცდომაა რომელიც გამოგეპარებათ

print(int( 5 ) + str( "good" )) 
#ეს მიმატება შეუდზლებელია რადგან string-ი int-ეს ვერანაირად ვერ დაემატება

budget = 20       #budget = 20
print(20 + 10)    #print(budget + 10)
#ამ შემთხვევაში ეს კოდი იმიტომ არის არასწორი რადგან ჩვენ პირველ ხაზე
#შევქმენით ცვლადი რომელსაც მივანიჭეთ მნიშვენლობა 
#ხოლო მერე ჩვენ ამ მნიშვნელობას დავუმატეთ 10 მგარმ ჩვენ ჯერ უნდა
#დავწეროთ ეს ცვლადი რადგან ის არ გამოიტანს მიმატებას რაც ჩვენ გვინდა

