# 1. ფუნქცია, რომელიც მომხმარებელს შემოატანინებს რიცხვს და დაუმატებს მას 1-ს:

def add_one(number):
    return number + 1

# 2. ფუნქცია, რომელიც მომხმარებელს შემოატანინებს რიცხვს და დააბრუნებს "მაგარია!", თუ რიცხვი 10-ზე მეტია:

def is_great(number):
    if number > 10:
        return "მაგარია!"
    else:
        return "რიცხვი 10-ზე ნაკლებია"

# 3. ფუნქცია, რომელიც მომხმარებელს შემოატანინებს ორ ციფრს და დააბრუნებს მათ შორის უმცირესს:

def get_min(num1, num2):
    return min(num1, num2)

# 4. ფუნქცია, რომელიც მომხმარებელს შემოატანინებს ტექსტს და დააბრუნებს ტექსტის სიგრძეს:

def text_length(text):
    return len(text)

# 5. ფუნქცია, რომელიც მომხმარებელს შემოატანინებს ორ რიცხვს და დააბრუნებს მათ ჯამს:

def sum_two_numbers(num1, num2):
    return num1 + num2

# 6. ფუნქცია, რომელიც მომხმარებელს შემოატანინებს რიცხვს და დააბრუნებს "დადებითი", თუ ის დადებითი იქნება, და "უარყოფითი", თუ უარყოფითი:

def check_sign(number):
    if number > 0:
        return "დადებითი"
    elif number < 0:
        return "უარყოფითი"
    else:
        return "ნეიტრალური"

# 7. ფუნქცია, რომელიც მომხმარებელს შემოატანინებს რიცხვს და დააბრუნებს True, თუ ის ლუწია და False, თუ არა:

def is_even(number):
    return number % 2 == 0

# 8. ფუნქცია, რომელიც მომხმარებელს შემოატანინებს ორ რიცხვს და დააბრუნებს მათ ჯამს დამატებული 5:

def sum_plus_five(num1, num2):
    return num1 + num2 + 5
