1) რა დაგვიბეჭდავს ეს კოდი ტერმინალში ? print(typy("Hello, World!"))
პასუხი: str

2) როგორ შევქმნათ პითონში კომენტარი ?
პასუხი: #This is comment

3) რისთვის ვიყენებთ range() ფუნქციას ?
პასუხი: შევქნათ რიცხვების დიაპაზონი, გვქონდეს თანმიმდევრობა

4) სტრინგების კონკატინაციისთვის რომელ ოპერატორს ვიყენებთ ?
პასუხი: +

5)ამ 4-დან, რომელი არ არის სწორი მონაცემთა ტიპი ?
პასუხი: real

6)რომელი ფუნქციის გამოყენებით შეგვიძლია მომხმარებელს შემოვატანინოთ ინფორმაცია ?
პასუხი: input()

7)რომელი სიტყვით (keyword) შეიქმნება ციკლი ?
პასუხი: for

8)რომელი ფუნქციით გადავაქცევთ ტექსტურ ინფორმაციას ათწილადად ?
პასუხი:float

9)რას დაგვიბეჭდავს ეს კოდი: print(2 > 3) ?
პასუხი: False

10)რომელი კოდით შევქმნათ უსასრულო ციკლს ?
პასუხი: While True:

11)რას დაბეჭდავს ეს კოდი: print('Hello ' + 'World')
პასუხი: Hello World

12)რას დაგვიბეჭდავს ეს კოდი: print(4 % 2)
პასუხი: 0

13)რომელია პიტონის ფაილის სწორი დაბოლოება ?
პასუხი:.py

14)რას დაგვიბეჭდავს ეს კოდი: print(10 == 10)
პასუხი: True

15)ამ 4-დან, რომელია ცვლადის სწორი სახელი ?
პასუხი:_var_name

16)რას დაგვიბეჭდავს ეს კოდი: print('5' * 3) ?
პასუხი: 555

17)რას დაგვიბეჭდავს ეს კოდი: print('Hello'[-1]) ?
პასუხი: o

18)რას დაგვიბეჭდავს ეს კოდი: print(list(range(2, 10, 2))) ?
პასუხი: [2, 4, 6, 8]

19)რას ვიყენებთვ While ციკლს?
პასუხი: კოდი თავიდან გაეშვას, მაშინ როდესაც ციკლის პირობა იქნება სწორი

20)ამ 4-დან, რომელი წინადადებაა სწორი while ციკლების შესახებ ?
პასუხი: while ციკლი შესაძლოა უსასრულოდ გაგრძელდეს, თუ მისი პირობა სულ სწორი იქნება 

21)boolean მონაცემთა ტიპის შესაძლო მნიშვნელობებია ?
პასუხი: True და False

22)ამ 4 კოდიდან, რომლის მნიშვნელობა იქნება True ?
პასუხი: 1<=1

23)რომელი ოპერატორით ვამოწმებთ, ორივე boolean თუ არის True-ს ტოლი 
პასუხი: and

24)როგორ დავბეჭდოთ 30? my_list = [10, 20, 30, 40]
პასუხი: my_list[2]

25)ამ 4-დან, რომელია სწორი პითონის სია ?
პასუხი: list = [1, 2, 3]

26)რას ნიშნავს HTML ?
პასუხი: HyperText Markup Language

27) რა არის <head> თეგის დანიშნულება?
პასუხი: საიტის ტექნიკური ინფორმაციის შენახვა

28) რომელი თეგით შეიქმნება hyperlink?
პასუხი: <a>

29) ყველაზე დიდი სათური რომელი თეგით შეიქმნება?
პასუხი: <h1>

30) რომელი ატრიბუტი გამოიყენება სურათის ალტერნატიული ტექსტის დასაწერად?
პასუხი: alt

31) რაში გამოიყენება title თეგი?
პასუხი: ვქნით html- ის დოკუმენტის სათურს

32) ხაზის გასაწყვეტად რომელს თეგს ვიყენებთ?
პასუხი: <br>

33) დაულაგებელი სიის შესაქმნელად რომელ ელემენტს ვიყენებთ?
პასუხი: <ul>

34) როგორ შევქმნათ checkbox
პასუხი: <input type="checkbox">

35) რომელი ატრიბუტით შეგვიძლია CSS-ის გაწერა?
პასუხი: style

36) ტექსტის შესატანი ველი როგორ შევქმნათ?
პასუხი: <input text="text"

37) რომელი ატრიბუტით მივუთითებთ hyperlink-ის მისამართს?
პასუხი: href

38) რას წარმოადგენ em თეგი?
პასუხი: დახრილი ტექსტი 

39) რომელი თეგით შეიქმნება form?
პასუხი: <from>

40) რომელი ატრიბუტით გახდება ელემენტი უნიკალური?
პასუხი: id 

41) როგორ შევქმნათ დალაგებული სია?
პასუხი: <ol>

42) რომელიო თეგით შეიქმნება dropdown მენიუ?
პასუხი: <select>

43) რას წარმოადგენს nav თეგი?
პასუხი: სექცია, სადაც გვაქვს ნავიგაციის ლინკები

44) რისთვის გამოიყენება main თეგი?
პასუხი: საიტის მთავარი ნაწილის შექმნა

45) რომელი html-ს კომენტარი?
პასუხი: #<!-- this is comment -->

46) რომელი ატრიბუტით მივუთითებთ, რომ input აუცილებლად უნდა შეივსოს?
პასუხი: required

47) სურათს რომელი თეგით დავამატებთ საიტზე?
პასუხი: <img>

48) აუდიო ფაილებს დასამატებლად რომელ თეგს ვიყენებთ?
პასუხი: <audio>

49) ვიდეო ფაილების დასამატებლად რომელ თეგს ვიყენებთ?
პასუხი: <video>

50) GOA >დანარჩენი პროგრამირების აკადემია?
პასუხი: True